
public enum Days {

    /*
        Күндөргө enum түзүңүз (Monday, Tuesday ...)   Консолдон бир күндү белгилеңиз.
Эгер Monday болсо - анда "Дуйшөмбү куну жава окуйм" же Tuesday болсо - анда  "Шейшемби күнү англис тили сабагын окуйм"
деп күнгө жараша кайсы сабакты окуганыңызды консолго чыгарыңыз. Жуманын күндөрүн кыргыз тилинде көрсөтүңүз.  */



    MONDAY("Дуйшөмбү куну жава окуйм"),
    TUESDAY("Шейшемби күнү англис тили сабагын окуйм"),
    WEDNESDAY("Шаршемби күнү корей тили сабагын окуйм"),
    THURSDAY("Бейшемби куну javaScript окуйм"),
    FRIDAY("Жума күнү питон тилин окуйм"),
    SATURDAY("Дуйшөмбү куну япон тилин окуйм"),
    SUNDAY("Дуйшөмбү куну кытай тилин окуйм");

    private final String name;

    Days(String name) {
        this.name = name;
    }

    public String getName() {
        return name;
    }
}


